"""
سمیه کلاس دوم دبستان درس می خونه و تازه داره جمع کردن اعداد رو یاد میگیره
معلم کلاس جمع یه سری عدد رو روی تخته نوشته و دانش آموزان باید جمع اعداد مورد
نظر رو حساب کنند. برای اینکه کار ساده تر بشه اعدادی که باید جمع بشن فقط یک و
دو و سه هستند. اما اینم کافی نیست و دانش آموزا فقط وقتی می تونن جمع رو انجام
بدن که اعداد به ترتیب غیر نزولی چیده شده باشه )یعنی اول یک ها بعد دو ها و بعد
سه ها( شما باید عبارتی که معلم پای تخته نوشته را به عنوان ورودی بخوانید و در
خروجی عبارتی که توضیح داده شد را تولید کنید تا سمیه و دیگر شاگردان بتوانند آن را
حساب کنند

مثال ورودی -> 1+1+3+1+3 
خروجی نمونه -> 1+1+1+3+3
"""

string = input("Enter your string: ")
numbers = list(map(int, string.split("+")))
numbers.sort()
output_str = "+".join(map(str, numbers))
print(output_str)