"""
سارا به تازگی یادگرفته تایپ کنه و وارد اینترنت بشه. همینکه وارد اینترنت شد
تصمیم گرفت وارد یه چت روم بشه و به همه سالم کنه. سارا یه کلمه را توی
چت روم وارد کرد. اگه بشه تعدادی از حروف کلمه ای که سارا وارد کرده را
حذف کرد و در آخر کلمه ی helloباقی بمونه یعنی سارا تونسته بگه helloدر
غیر این صورت خیر.
تضمین میشود که ورودی فقط متشکل از حروف کوچک انگلیسی است.
"""

def check_hello(string):
    for i in range(len(string)-4):
        if string[i:i+5] == "hello":
            return "Yes"
    return "No"

print(check_hello("ahello"))
print(check_hello("hlello"))